espressif/esp-idf/components/soc/esp32s2beta/include/soc/slc_reg.h
#define SLC_0INT_ENA1_REG          (DR_REG_SLC_BASE + 0x140)
/* SLC_SLC0_HOST_POP_EOF_ERR_INT_ENA1 : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ENA1  (BIT(27))
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ENA1_M  (BIT(27))
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ENA1_V  0x1
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ENA1_S  27
/* SLC_SLC0_RX_QUICK_EOF_INT_ENA1 : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_QUICK_EOF_INT_ENA1  (BIT(26))
#define SLC_SLC0_RX_QUICK_EOF_INT_ENA1_M  (BIT(26))
#define SLC_SLC0_RX_QUICK_EOF_INT_ENA1_V  0x1
#define SLC_SLC0_RX_QUICK_EOF_INT_ENA1_S  26
/* SLC_CMD_DTC_INT_ENA1 : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define SLC_CMD_DTC_INT_ENA1  (BIT(25))
#define SLC_CMD_DTC_INT_ENA1_M  (BIT(25))
#define SLC_CMD_DTC_INT_ENA1_V  0x1
#define SLC_CMD_DTC_INT_ENA1_S  25
/* SLC_SLC0_TX_ERR_EOF_INT_ENA1 : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_ERR_EOF_INT_ENA1  (BIT(24))
#define SLC_SLC0_TX_ERR_EOF_INT_ENA1_M  (BIT(24))
#define SLC_SLC0_TX_ERR_EOF_INT_ENA1_V  0x1
#define SLC_SLC0_TX_ERR_EOF_INT_ENA1_S  24
/* SLC_SLC0_WR_RETRY_DONE_INT_ENA1 : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_WR_RETRY_DONE_INT_ENA1  (BIT(23))
#define SLC_SLC0_WR_RETRY_DONE_INT_ENA1_M  (BIT(23))
#define SLC_SLC0_WR_RETRY_DONE_INT_ENA1_V  0x1
#define SLC_SLC0_WR_RETRY_DONE_INT_ENA1_S  23
/* SLC_SLC0_HOST_RD_ACK_INT_ENA1 : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_HOST_RD_ACK_INT_ENA1  (BIT(22))
#define SLC_SLC0_HOST_RD_ACK_INT_ENA1_M  (BIT(22))
#define SLC_SLC0_HOST_RD_ACK_INT_ENA1_V  0x1
#define SLC_SLC0_HOST_RD_ACK_INT_ENA1_S  22
/* SLC_SLC0_TX_DSCR_EMPTY_INT_ENA1 : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ENA1  (BIT(21))
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ENA1_M  (BIT(21))
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ENA1_V  0x1
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ENA1_S  21
/* SLC_SLC0_RX_DSCR_ERR_INT_ENA1 : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_DSCR_ERR_INT_ENA1  (BIT(20))
#define SLC_SLC0_RX_DSCR_ERR_INT_ENA1_M  (BIT(20))
#define SLC_SLC0_RX_DSCR_ERR_INT_ENA1_V  0x1
#define SLC_SLC0_RX_DSCR_ERR_INT_ENA1_S  20
/* SLC_SLC0_TX_DSCR_ERR_INT_ENA1 : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_DSCR_ERR_INT_ENA1  (BIT(19))
#define SLC_SLC0_TX_DSCR_ERR_INT_ENA1_M  (BIT(19))
#define SLC_SLC0_TX_DSCR_ERR_INT_ENA1_V  0x1
#define SLC_SLC0_TX_DSCR_ERR_INT_ENA1_S  19
/* SLC_SLC0_TOHOST_INT_ENA1 : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TOHOST_INT_ENA1  (BIT(18))
#define SLC_SLC0_TOHOST_INT_ENA1_M  (BIT(18))
#define SLC_SLC0_TOHOST_INT_ENA1_V  0x1
#define SLC_SLC0_TOHOST_INT_ENA1_S  18
/* SLC_SLC0_RX_EOF_INT_ENA1 : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_EOF_INT_ENA1  (BIT(17))
#define SLC_SLC0_RX_EOF_INT_ENA1_M  (BIT(17))
#define SLC_SLC0_RX_EOF_INT_ENA1_V  0x1
#define SLC_SLC0_RX_EOF_INT_ENA1_S  17
/* SLC_SLC0_RX_DONE_INT_ENA1 : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_DONE_INT_ENA1  (BIT(16))
#define SLC_SLC0_RX_DONE_INT_ENA1_M  (BIT(16))
#define SLC_SLC0_RX_DONE_INT_ENA1_V  0x1
#define SLC_SLC0_RX_DONE_INT_ENA1_S  16
/* SLC_SLC0_TX_SUC_EOF_INT_ENA1 : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_SUC_EOF_INT_ENA1  (BIT(15))
#define SLC_SLC0_TX_SUC_EOF_INT_ENA1_M  (BIT(15))
#define SLC_SLC0_TX_SUC_EOF_INT_ENA1_V  0x1
#define SLC_SLC0_TX_SUC_EOF_INT_ENA1_S  15
/* SLC_SLC0_TX_DONE_INT_ENA1 : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_DONE_INT_ENA1  (BIT(14))
#define SLC_SLC0_TX_DONE_INT_ENA1_M  (BIT(14))
#define SLC_SLC0_TX_DONE_INT_ENA1_V  0x1
#define SLC_SLC0_TX_DONE_INT_ENA1_S  14
/* SLC_SLC0_TOKEN1_1TO0_INT_ENA1 : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TOKEN1_1TO0_INT_ENA1  (BIT(13))
#define SLC_SLC0_TOKEN1_1TO0_INT_ENA1_M  (BIT(13))
#define SLC_SLC0_TOKEN1_1TO0_INT_ENA1_V  0x1
#define SLC_SLC0_TOKEN1_1TO0_INT_ENA1_S  13
/* SLC_SLC0_TOKEN0_1TO0_INT_ENA1 : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TOKEN0_1TO0_INT_ENA1  (BIT(12))
#define SLC_SLC0_TOKEN0_1TO0_INT_ENA1_M  (BIT(12))
#define SLC_SLC0_TOKEN0_1TO0_INT_ENA1_V  0x1
#define SLC_SLC0_TOKEN0_1TO0_INT_ENA1_S  12
/* SLC_SLC0_TX_OVF_INT_ENA1 : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_OVF_INT_ENA1  (BIT(11))
#define SLC_SLC0_TX_OVF_INT_ENA1_M  (BIT(11))
#define SLC_SLC0_TX_OVF_INT_ENA1_V  0x1
#define SLC_SLC0_TX_OVF_INT_ENA1_S  11
/* SLC_SLC0_RX_UDF_INT_ENA1 : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_UDF_INT_ENA1  (BIT(10))
#define SLC_SLC0_RX_UDF_INT_ENA1_M  (BIT(10))
#define SLC_SLC0_RX_UDF_INT_ENA1_V  0x1
#define SLC_SLC0_RX_UDF_INT_ENA1_S  10
/* SLC_SLC0_TX_START_INT_ENA1 : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_START_INT_ENA1  (BIT(9))
#define SLC_SLC0_TX_START_INT_ENA1_M  (BIT(9))
#define SLC_SLC0_TX_START_INT_ENA1_V  0x1
#define SLC_SLC0_TX_START_INT_ENA1_S  9
/* SLC_SLC0_RX_START_INT_ENA1 : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_START_INT_ENA1  (BIT(8))
#define SLC_SLC0_RX_START_INT_ENA1_M  (BIT(8))
#define SLC_SLC0_RX_START_INT_ENA1_V  0x1
#define SLC_SLC0_RX_START_INT_ENA1_S  8
/* SLC_FRHOST_BIT7_INT_ENA1 : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT7_INT_ENA1  (BIT(7))
#define SLC_FRHOST_BIT7_INT_ENA1_M  (BIT(7))
#define SLC_FRHOST_BIT7_INT_ENA1_V  0x1
#define SLC_FRHOST_BIT7_INT_ENA1_S  7
/* SLC_FRHOST_BIT6_INT_ENA1 : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT6_INT_ENA1  (BIT(6))
#define SLC_FRHOST_BIT6_INT_ENA1_M  (BIT(6))
#define SLC_FRHOST_BIT6_INT_ENA1_V  0x1
#define SLC_FRHOST_BIT6_INT_ENA1_S  6
/* SLC_FRHOST_BIT5_INT_ENA1 : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT5_INT_ENA1  (BIT(5))
#define SLC_FRHOST_BIT5_INT_ENA1_M  (BIT(5))
#define SLC_FRHOST_BIT5_INT_ENA1_V  0x1
#define SLC_FRHOST_BIT5_INT_ENA1_S  5
/* SLC_FRHOST_BIT4_INT_ENA1 : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT4_INT_ENA1  (BIT(4))
#define SLC_FRHOST_BIT4_INT_ENA1_M  (BIT(4))
#define SLC_FRHOST_BIT4_INT_ENA1_V  0x1
#define SLC_FRHOST_BIT4_INT_ENA1_S  4
/* SLC_FRHOST_BIT3_INT_ENA1 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT3_INT_ENA1  (BIT(3))
#define SLC_FRHOST_BIT3_INT_ENA1_M  (BIT(3))
#define SLC_FRHOST_BIT3_INT_ENA1_V  0x1
#define SLC_FRHOST_BIT3_INT_ENA1_S  3
/* SLC_FRHOST_BIT2_INT_ENA1 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT2_INT_ENA1  (BIT(2))
#define SLC_FRHOST_BIT2_INT_ENA1_M  (BIT(2))
#define SLC_FRHOST_BIT2_INT_ENA1_V  0x1
#define SLC_FRHOST_BIT2_INT_ENA1_S  2
/* SLC_FRHOST_BIT1_INT_ENA1 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT1_INT_ENA1  (BIT(1))
#define SLC_FRHOST_BIT1_INT_ENA1_M  (BIT(1))
#define SLC_FRHOST_BIT1_INT_ENA1_V  0x1
#define SLC_FRHOST_BIT1_INT_ENA1_S  1
/* SLC_FRHOST_BIT0_INT_ENA1 : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT0_INT_ENA1  (BIT(0))
#define SLC_FRHOST_BIT0_INT_ENA1_M  (BIT(0))
#define SLC_FRHOST_BIT0_INT_ENA1_V  0x1
#define SLC_FRHOST_BIT0_INT_ENA1_S  0

#define SLC_DATE_REG          (DR_REG_SLC_BASE + 0x1F8)
/* SLC_DATE : R/W ;bitpos:[31:0] ;default: 32'h18080700 ; */
/*description: */
#define SLC_DATE  0xFFFFFFFF
#define SLC_DATE_M  ((SLC_DATE_V)<<(SLC_DATE_S))
#define SLC_DATE_V  0xFFFFFFFF
#define SLC_DATE_S  0

#define SLC_ID_REG          (DR_REG_SLC_BASE + 0x1FC)
/* SLC_ID : R/W ;bitpos:[31:0] ;default: 32'h0100 ; */
/*description: */
#define SLC_ID  0xFFFFFFFF
#define SLC_ID_M  ((SLC_ID_V)<<(SLC_ID_S))
#define SLC_ID_V  0xFFFFFFFF
#define SLC_ID_S  0

#ifdef __cplusplus
}
#endif



#endif /*_SOC_SLC_REG_H_ */


